src/Documents/ИС_Сбер_Отправление.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ИС_Сбер_Отправление</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>orderCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>confirmedTimeLimit</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>packingTimeLimit</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>shippingTimeLimit</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>shipmentDateFrom</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>shipmentDateTo</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>deliveryId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>shipmentDateShift</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>shipmentIsChangeable</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>customerFullName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>customerAddress</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>shippingPoint</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>deliveryDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>deliveryDateFrom</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>deliveryDateTo</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>status</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_Сбер_СтатусыОтправлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>deliveryMethodId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>serviceScheme</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>customer</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>depositedAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>items</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>itemIndex</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>status</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИС_Сбер_СтатусыОтправлений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>subStatus</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИС_Сбер_ДетализацияСтатусовОтмены</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>price</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>finalPrice</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>quantity</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>offerId</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>goodsId</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>digitalMark</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>boxIndex</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураМегаМаркета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИС_Сбер_Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ИС_Сбер_Товары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_Сбер_Товары</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ЛичныйКабинет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>offerID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ИС_Сбер_СтатусыОтправлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_Сбер_СтатусыОтправлений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>MERCHANT_CANCELED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NEW</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PENDING</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PENDING_CONFIRMATION</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CONFIRMED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PENDING_PACKING</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PACKED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PENDING_SHIPPING</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SHIPPED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PACKING_EXPIRED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SHIPPING_EXPIRED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DELIVERED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CUSTOMER_CANCELED</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ИС_Сбер_УпаковкаТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ИС_Сбер_УпаковкаТоваров</Name>
			<Comment>ИнфоСофт Власова И.С. 22.03.24 УА #71520</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПечатиЭтикеток</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_НастройкиПечати</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ИС_Сбер_Отправление</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЗаказ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтикеткаРаспечатана</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ИС_Сбер_Отправление/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОписаниеПеременных

//+ ИнфоСофт Ивонин К.А. 12.11.23 УА #55166
&НаКлиенте
Перем ВременныеФайлы; 
//- ИнфоСофт Ивонин К.А. 12.11.23 УА #55166

#КонецОбласти

#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Ивонин К.А. 12.11.23 УА #55166
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИС_MP_Сервер.ПриСозданииНаСервере(ЭтотОбъект);
	
	Список.ТекстЗапроса = ИС_Сбер_СерверЛокализация.ПолучитьЗапросСпискаОтправлений();
	Список.ОсновнаяТаблица = "Документ.ИС_Сбер_Отправление";
	
	ОтборОтправлений = "Все";                                
	
	//+ ИнфоСофт Мурсалимов Д.Р. 05.04.24 УА #73236
	СортировкаПечати = "Номер";
	//- ИнфоСофт Мурсалимов Д.Р. 05.04.24 УА #73236
	
	//+ ИнфоСофт Конышев А.Е. 09.12.24 УА #77940
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОрдерныеСклады") Тогда	
		Элементы.РасходныйОрдер.Видимость = Ложь;	
	КонецЕсли;                               
	//- ИнфоСофт Конышев А.Е. 09.12.24 УА #77940
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 12.11.23 УА #55166

//+ ИнфоСофт Ивонин К.А. 12.11.23 УА #55166
&НаКлиенте
Процедура ПриОткрытии(Отказ)
    
    #Если ВебКлиент Тогда                         
	ПодключитьРасширениеДляРаботыСФайлами(Истина);
	#КонецЕсли
    
    ВременныеФайлы = Новый Массив;
	ПрименитьНастрокиПрофиля();
	УстановитьОтборыОтправлений();
    ЗаполнитьОтборОтправлений();
    Элементы.СписокТоваров.Видимость = ОтображатьСоставОтправлений;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 12.11.23 УА #55166

//+ ИнфоСофт Ивонин К.А. 12.11.23 УА #55166
&НаКлиенте
Процедура ПрофильПриИзменении(Элемент)
	ПрименитьНастрокиПрофиля();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 12.11.23 УА #55166

//+ ИнфоСофт Ивонин К.А. 12.11.23 УА #55166
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ОтображатьСоставОтправлений Тогда
		
		МассивСтрок = Элементы.Список.ВыделенныеСтроки;
		
		Если МассивСтрок = Неопределено Или МассивСтрок.Количество() = 0 Тогда 
			ЗаполнитьОтборОтправлений();                                       
			Возврат;
		КонецЕсли;
		
		ЗаполнитьОтборОтправлений(МассивСтрок);
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 12.11.23 УА #55166

//+ ИнфоСофт Ивонин К.А. 12.11.23 УА #55166
&НаКлиенте
Процедура ОтображатьСоставОтправленийПриИзменении(Элемент)
	
	Элементы.СписокТоваров.Видимость = ОтображатьСоставОтправлений;
	
	Если ОтображатьСоставОтправлений Тогда
		
		МассивСтрок = Элементы.Список.ВыделенныеСтроки;
		
		Если МассивСтрок = Неопределено Или МассивСтрок.Количество() = 0 Тогда 
			ЗаполнитьОтборОтправлений();                                       
			Возврат;
		КонецЕсли;
		
		ЗаполнитьОтборОтправлений(МассивСтрок);
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 12.11.23 УА #55166

//+ ИнфоСофт Ивонин К.А. 12.11.23 УА #55166
&НаКлиенте
Процедура ОтборОтправленийПриИзменении(Элемент)
	УстановитьОтборыОтправлений();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 12.11.23 УА #55166

//+ ИнфоСофт Ивонин К.А. 21.11.23 УА #55166
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элемент.ТекущиеДанные; 
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле = Элементы.Заказ Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если Элемент.ТекущиеДанные.Заказ.Пустая() Тогда
			Возврат;
		КонецЕсли;
		
		ПоказатьЗначение(, Элемент.ТекущиеДанные.Заказ);
	
	ИначеЕсли Поле = Элементы.Реализация Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.Реализация) Тогда
			Возврат;
		ИначеЕсли ТипЗнч(Элемент.ТекущиеДанные.Реализация) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			ПоказатьЗначение(, Элемент.ТекущиеДанные.Реализация);
		Иначе
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Заказ", Элемент.ТекущиеДанные.Заказ);
			//+ ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
			ПараметрыФормы.Вставить("ДокументыРеализации", Истина);
			//- ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
			ОткрытьФорму("ОбщаяФорма.ИС_WB_ФормаРТУ", ПараметрыФормы);
		КонецЕсли 
		
	//+ ИнфоСофт Конышев А.Е. 10.12.24 УА #77940
	ИначеЕсли Поле = Элементы.РасходныйОрдер Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.РасходныйОрдер) Тогда
			Возврат;
		//+ ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201			
		//ИначеЕсли ТипЗнч(Элемент.ТекущиеДанные.РасходныйОрдер) = Тип("ДокументСсылка.РасходныйОрдер") Тогда
		ИначеЕсли ТипЗнч(Элемент.ТекущиеДанные.РасходныйОрдер) = Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда
		//- ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
			ПоказатьЗначение(, Элемент.ТекущиеДанные.РасходныйОрдер);
		//+ ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
		Иначе
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Заказ", Элемент.ТекущиеДанные.Заказ);
			ПараметрыФормы.Вставить("ДокументыРеализации", Ложь);
			ОткрытьФорму("ОбщаяФорма.ИС_WB_ФормаРТУ", ПараметрыФормы);
		//- ИнфоСофт Стояк Ю.К. 26.12.2024 УА #90201
		КонецЕсли
		
	//- ИнфоСофт Конышев А.Е. 10.12.24 УА #77940	
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 21.11.23 УА #55166

//+ ИнфоСофт Ивонин К.А. 12.11.23 УА #55166
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	Для Каждого Элемент Из ВременныеФайлы Цикл

		Попытка
			НачатьУдалениеФайлов(Новый ОписаниеОповещения, Элемент);	
		Исключение	
		КонецПопытки;		
		
	КонецЦикла;	
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 12.11.23 УА #55166

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

//+ ИнфоСофт Ивонин К.А. 12.11.23 УА #55166
&НаКлиенте
Процедура ЗагрузитьОтправления(Команда)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран ""Профиль""", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	//+ ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
	РеглРаботает = ПроверитьРегламетноеЗаданиеНаСервере(Профиль, "СберЗагрузкаОтправлений");
	
	Если Не РеглРаботает Тогда    
		
		ДлительнаяОперация = ЗагрузитьОтправленияНаСервере(Профиль, ЗагружатьЗаказыС, УникальныйИдентификатор);
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПолучениеЗаказовЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания());
		
		Элементы["КартинкаОжидание"].Видимость = Истина;		
		
		//ЗагрузитьОтправленияНаСервере();	
		
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Уже выполняется регламентное задание по загрузке заказов, обновите форму чуть позже");
	КонецЕсли;                                      
	//Элементы.Список.Обновить();
	//- ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 12.11.23 УА #55166

//+ ИнфоСофт Ивонин К.А. 12.11.23 УА #55166
&НаКлиенте
Процедура ОбновитьСтатусы(Команда)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран ""Профиль""", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	//+ ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
	РеглРаботает = ПроверитьРегламетноеЗаданиеНаСервере(Профиль, "ОбновлениеСтатусовСборочныхЗаданийАли");
	
	Если Не РеглРаботает Тогда    
		
		ДлительнаяОперация = ОбновитьСтатусыНаСервере(Профиль, УникальныйИдентификатор);
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбновитьСтатусыЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания());
		
		Элементы["КартинкаОжиданиеСтатусы"].Видимость = Истина;		
		
		//ОбновитьСтатусыНаСервере(Профиль);		
		
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Уже выполняется регламентное задание по загрузке заказов, обновите форму чуть позже");
	КонецЕсли;                                      
	//Элементы.Список.Обновить();
	//- ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 12.11.23 УА #55166

//+ ИнфоСофт Ивонин К.А. 12.11.23 УА #55166
&НаКлиенте
Процедура ПечатьЭтикетки(Команда)
    
    ОчиститьСообщения();
    
	Если Не ЗначениеЗаполнено(Профиль) Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран ""Профиль""", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	МассивЗаказов = Элементы.Список.ВыделенныеСтроки;
	
	Если МассивЗаказов = Неопределено Или МассивЗаказов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	

	Результат = ПечатьЭтикеткиНаСервере(Профиль, МассивЗаказов);
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЭтикетки = ПолучитьИзВременногоХранилища(Результат);
	
	НачатьПолучениеКаталогаВременныхФайлов(Новый ОписаниеОповещения("ПечатьЭтикеткиЗавершение", ЭтотОбъект, ДанныеЭтикетки));
			
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 12.11.23 УА #55166

//+ ИнфоСофт Ивонин К.А. 20.11.23 УА #55166
&НаКлиенте
Процедура СоздатьЗаказы(Команда)
	
	ОчиститьСообщения();
    
	Если Не ЗначениеЗаполнено(Профиль) Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран ""Профиль""", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки = Неопределено Или ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьЗаказыНаСервере(Профиль, ВыделенныеСтроки);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 20.11.23 УА #55166

//+ ИнфоСофт Ивонин К.А. 28.11.23 УА #55166
&НаКлиенте
Процедура СоздатьРеализации(Команда)

	ОчиститьСообщения();
    
	Если Не ЗначениеЗаполнено(Профиль) Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран ""Профиль""", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки = Неопределено Или ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьРеализацииНаСервере(Профиль, ВыделенныеСтроки);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 28.11.23 УА #55166

//+ ИнфоСофт Ивонин К.А. 17.02.24 УА #67209
&НаКлиенте
Процедура ВыпонитьДействиеНадЛотами(Команда)

	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	Если Команда.Имя = "ПодтвердитьЛоты" Тогда
		Действие = "Подтвердить";
	ИначеЕсли Команда.Имя = "ОтменитьЛоты" Тогда
		Действие = "Отменить";
	ИначеЕсли Команда.Имя = "КомплектоватьЛоты" Тогда
		Действие = "Скомплектовать";
	ИначеЕсли Команда.Имя = "ОтгрузитьЛоты" Тогда
		Действие = "Отгрузить";
	КонецЕсли;

    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("Действие", Действие);
    ПараметрыФормы.Вставить("Профиль", Профиль);
    ПараметрыФормы.Вставить("МассивОтправлений", ВыделенныеСтроки);
	
	ОткрытьФорму("Документ.ИС_Сбер_Отправление.Форма.ФормаДействийПоОтправлениям", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 17.02.24 УА #67209

//+ ИнфоСофт Заварин К.В. 20.03.24 УА #66299
&НаКлиенте
Процедура ПечатьЛистаПодбора(Команда)
    
		ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
			
		Если ВыделенныеСтроки = Неопределено Или ВыделенныеСтроки.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
 	
	ТабДок = ПолучитьЛистПодбораНаСервере(ВыделенныеСтроки);
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Лист Подбора МегаМаркет");
	
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабДок;
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
	КоллекцияПечатныхФорм[0].СинонимМакета = "Лист Подбора МегаМаркет";
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтотОбъект);

КонецПроцедуры //- ИнфоСофт Заварин К.В. 20.03.24 УА #66299

//+ ИнфоСофт Стояк Ю.К. 03.06.2024 УА #76167
&НаКлиенте
Процедура ОткрытьФормуСборкиЗаказов(Команда)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Профиль", Профиль);
	
	Если ВыделенныеСтроки.Количество() <> 0 Тогда
		ПараметрыОткрытия.Вставить("ВыделенныеСтроки", ВыделенныеСтроки);
	КонецЕсли;
	
	ОткрытьФорму("Документ.ИС_Сбер_УпаковкаТоваров.Форма.ФормаДокумента", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 03.06.2024 УА #76167

//+ ИнфоСофт Стояк Ю.К. 03.06.2024 УА #76167
&НаКлиенте
Процедура ПечатьРеестраПриемаПередачи(Команда)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки = Неопределено Или ВыделенныеСтроки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выделено ни одного отправления для печати Реестра!");
		Возврат;
	КонецЕсли;
	
	ТабДок = ПолучитьРеестрПриемаПередачи(ВыделенныеСтроки); 
	
	Если ТабДок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Реестр приема-передачи отправлений МегаМаркет");
	
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабДок;
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
	КоллекцияПечатныхФорм[0].СинонимМакета = "Реестр приема-передачи отправлений МегаМаркет";
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтотОбъект);
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 03.06.2024 УА #76167

//+ ИнфоСофт Стояк Ю.К. 02.11.2024 УА #70035
&НаКлиенте
Процедура ПечатьТоварногоЧека(Команда)  
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки = Неопределено Или ВыделенныеСтроки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выделено ни одного отправления для печати товарного чека!");
		Возврат;
	КонецЕсли;
	
	ТабДок = ПолучитьТоварныйЧек(ВыделенныеСтроки); 
	
	Если ТабДок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Товарные чеки МегаМаркет");
	
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабДок;
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
	КоллекцияПечатныхФорм[0].СинонимМакета = "Реестр приема-передачи отправлений МегаМаркет";
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтотОбъект);  
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 02.11.2024 УА #70035

//+ ИнфоСофт Заварин К.В. 13.11.24 УА #85881
&НаКлиенте
Процедура ПометитьНаУдалениеПривязанныеДокументы(Команда)
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран Профиль", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
			
	Если ВыделенныеСтроки = Неопределено Или ВыделенныеСтроки.Количество() = 0 Тогда
	 	ОбщегоНазначенияКлиент.СообщитьПользователю(
	 		"Для пометки на удаление нужно выделить необходимые сборочные задания");
		Возврат;
	КонецЕсли;
	
	ПометитьНаУдалениеПривязанныеДокументыНаСервере();
	Элементы.Список.Обновить();	
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Документы успешно помечены на удаление");
	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 13.11.24 УА #85881

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 12.11.23 УА #55166
&НаСервереБезКонтекста
Функция ЗагрузитьОтправленияНаСервере(Профиль, ДатаПоследнегоСборочногоЗадания, УникальныйИдентификатор)
	
	//+ ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, 
	"ИС_Сбер_Сервер.ПолучитьСписокОтправлений", Профиль, ДатаПоследнегоСборочногоЗадания);
	
	//ИС_Сбер_Сервер.ПолучитьСписокОтправлений(Профиль, ЗагружатьЗаказыС);
	//- ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
	
КонецФункции //- ИнфоСофт Ивонин К.А. 12.11.23 УА #55166
              
//+ ИнфоСофт Ивонин К.А. 12.11.23 УА #55166
&НаСервереБезКонтекста
Функция ОбновитьСтатусыНаСервере(Профиль, УникальныйИдентификатор)
	
	//+ ИнфоСофт Стояк Ю.К. 08.04.2024 УА #68800         	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, 
	"ИС_Сбер_Сервер.ОбновитьСтатусы", Профиль);
		
	//ИС_Сбер_Сервер.ОбновитьСтатусы(Профиль);
	//- ИнфоСофт Стояк Ю.К. 08.04.2024 УА #68800
	
КонецФункции //- ИнфоСофт Ивонин К.А. 12.11.23 УА #55166

//+ ИнфоСофт Ивонин К.А. 12.11.23 УА #55166
&НаКлиенте
Процедура ПрименитьНастрокиПрофиля()
    УстановитьДатуПоследнегоЗаказа();
	Список.Параметры.УстановитьЗначениеПараметра("Профиль", Профиль);	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 12.11.23 УА #55166

//+ ИнфоСофт Ивонин К.А. 12.11.23 УА #55166
&НаКлиенте
Процедура УстановитьДатуПоследнегоЗаказа()
	
    Если Не ЗначениеЗаполнено(Профиль) Тогда
		ЗагружатьЗаказыС = Дата(1, 1, 1);
		Возврат;
	КонецЕсли;

	ЗагружатьЗаказыС = ПолучитьДатуПоследнегоЗаказа(Профиль);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 12.11.23 УА #55166

//+ ИнфоСофт Ивонин К.А. 12.11.23 УА #55166
&НаСервереБезКонтекста   
Функция ПолучитьДатуПоследнегоЗаказа(Профиль)
	Возврат ИС_Сбер_Сервер.ПолучитьДатуПоследнегоЗаказа(Профиль); 	
КонецФункции //- ИнфоСофт Ивонин К.А. 12.11.23 УА #55166

//+ ИнфоСофт Ивонин К.А. 12.11.23 УА #55166
&НаКлиенте
Процедура ЗаполнитьОтборОтправлений(Отбор = Неопределено)
	СписокТоваров.Параметры.УстановитьЗначениеПараметра("Ссылка", Отбор);	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 12.11.23 УА #55166

//+ ИнфоСофт Ивонин К.А. 12.11.23 УА #55166
&НаКлиенте
Процедура УстановитьОтборыОтправлений()
    
    ВсеОтправления = Ложь;
    
    ВидимостьПодтверждения = Ложь;
    ВидимостьУпаковки = Ложь;
    ВидимостьДоставки = Ложь;
    ВидимостьДоставкиДоПокупателя = Ложь;
	
	ВидимостьПечатьЭтикеток = Ложь;
	
	ВидимостьПодтверждения = Ложь;
	ВидимостьКомплектации = Ложь;
	ВидимостьОтгрузки = Ложь;
	ВидимостьОтмены = Ложь; 
	
	//+ ИнфоСофт Стояк Ю.К. 03.06.2024 УА #76167
	ВидимостьУпаковкаТоваров = Ложь;		
	ВидимостьРеестрПриемаПередачи = Ложь;
	//- ИнфоСофт Стояк Ю.К. 03.06.2024 УА #76167
	
	Статусы = Новый Массив;

	Если ОтборОтправлений = "Подтверждение" Тогда                                                  		

		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_Сбер_СтатусыОтправлений.NEW"));
		
		ВидимостьПодтверждения = Истина;
		ВидимостьОтмены = Истина;
	
	ИначеЕсли ОтборОтправлений = "Комплектация" Тогда
	
		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_Сбер_СтатусыОтправлений.CONFIRMED"));
			
		ВидимостьПечатьЭтикеток = Истина;
		
		ВидимостьКомплектации = Истина;
		ВидимостьОтмены = Истина;
		
		//+ ИнфоСофт Стояк Ю.К. 03.06.2024 УА #76167
		ВидимостьУпаковкаТоваров = Истина;		
		ВидимостьРеестрПриемаПередачи = Истина;
		//- ИнфоСофт Стояк Ю.К. 03.06.2024 УА #76167
							
	ИначеЕсли ОтборОтправлений = "Отгрузка" Тогда
			
		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_Сбер_СтатусыОтправлений.PACKED"));
		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_Сбер_СтатусыОтправлений.SHIPPED"));
		
        ВидимостьПечатьЭтикеток = Истина;
        
        ВидимостьОтгрузки = Истина;
		ВидимостьОтмены = Истина; 
		
		//+ ИнфоСофт Стояк Ю.К. 03.06.2024 УА #76167
		ВидимостьУпаковкаТоваров = Истина;		
		ВидимостьРеестрПриемаПередачи = Истина;
		//- ИнфоСофт Стояк Ю.К. 03.06.2024 УА #76167
			
	ИначеЕсли ОтборОтправлений = "НеОтгруженные" Тогда
			
		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_Сбер_СтатусыОтправлений.SHIPPING_EXPIRED"));
						
	ИначеЕсли ОтборОтправлений = "Отменены" Тогда
		
		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_Сбер_СтатусыОтправлений.CUSTOMER_CANCELED"));
				
	Иначе // Все
	
		ВсеОтправления = Истина;
		Статусы.Добавить(ПредопределенноеЗначение("Перечисление.ИС_Сбер_СтатусыОтправлений.ПустаяСсылка")); 
		
		ВидимостьПодтверждения = Истина;
		ВидимостьУпаковки = Истина;
		ВидимостьДоставки = Истина;
		ВидимостьДоставкиДоПокупателя = Истина;
		
		ВидимостьПечатьЭтикеток = Истина;
		
		ВидимостьПодтверждения = Истина;
		ВидимостьКомплектации = Истина;
		ВидимостьОтгрузки = Истина;
		ВидимостьОтмены = Истина;
	
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("ВсеОтправления", ВсеОтправления); 
	Список.Параметры.УстановитьЗначениеПараметра("Статусы", Статусы);
	
	Элементы.ФормаПечатьЭтикетки.Видимость = ВидимостьПечатьЭтикеток;
	
	Элементы.confirmedTimeLimit.Видимость = ВидимостьПодтверждения;
	Элементы.packingTimeLimit.Видимость = ВидимостьУпаковки;
	Элементы.shippingTimeLimit.Видимость = ВидимостьДоставки;
	Элементы.deliveryDate.Видимость = ВидимостьДоставкиДоПокупателя;
	
	Элементы.СписокПодменюДействия.Видимость = ВидимостьОтмены;
	Элементы.СписокПодтвердитьЛоты.Видимость = ВидимостьПодтверждения;
	Элементы.СписокКомплектоватьЛоты.Видимость = ВидимостьКомплектации;
	Элементы.СписокОтгрузитьЛоты.Видимость = ВидимостьОтгрузки;
	Элементы.СписокОтменитьЛоты.Видимость = ВидимостьОтмены;
	//+ ИнфоСофт Стояк Ю.К. 03.06.2024 УА #76167
	Элементы.ОткрытьФормуСборкиЗаказов.Видимость = ВидимостьУпаковкаТоваров;
	Элементы.ПечатьРеестраПриемаПередачи.Видимость = ВидимостьРеестрПриемаПередачи;
	//- ИнфоСофт Стояк Ю.К. 03.06.2024 УА #76167

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 12.11.23 УА #55166

//+ ИнфоСофт Ивонин К.А. 12.11.23 УА #55166
&НаСервереБезКонтекста
Функция ПечатьЭтикеткиНаСервере(Профиль, МассивЗаказов)
	Возврат ИС_Сбер_Сервер.ПолучитьЭтикетки(Профиль, МассивЗаказов);
КонецФункции //- ИнфоСофт Ивонин К.А. 12.11.23 УА #55166

//+ ИнфоСофт Ивонин К.А. 20.11.23 УА #55166
&НаСервереБезКонтекста
Процедура СоздатьЗаказыНаСервере(Профиль, МассивОтправлений)
	ИС_Сбер_Сервер.СоздатьЗаказы(Профиль, МассивОтправлений);
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 20.11.23 УА #55166 

//+ ИнфоСофт Ивонин К.А. 20.11.23 УА #55166
&НаСервереБезКонтекста
Процедура СоздатьРеализацииНаСервере(Профиль, МассивОтправлений)
	ИС_Сбер_Сервер.СоздатьРеализации(Профиль, МассивОтправлений);
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 20.11.23 УА #55166

//+ ИнфоСофт Заварин К.В. 20.03.24 УА #66299
&НаСервере
Функция ПолучитьЛистПодбораНаСервере(ВыделенныеСтроки) 
	Табдок = Новый ТабличныйДокумент;
	
	Табдок.ИмяПараметровПечати = "ИС_Сбер_ПечатьЛистаПодбора";
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;  
	ТабДок.АвтоМасштаб = Истина;
	
	ТабДок.ПолеСправа = 7;
	
	МакетОбработки = УправлениеПечатью.МакетПечатнойФормы("Документ.ИС_Сбер_Отправление.ПФ_MXL_ЛистПодбора");
	
	ОбластьШапка = МакетОбработки.ПолучитьОбласть("Шапка|ОсновнойЛист");
	ОбластьШапка.Параметры.Дата = ТекущаяДатаСеанса();
	ОбластьШапка.Параметры.Профиль = Профиль;
	ОбластьШапка.Параметры.Сорт = Элементы.СортировкаПечати.СписокВыбора.НайтиПоЗначению(СортировкаПечати).Представление;
	
	Табдок.Вывести(ОбластьШапка);
	
	Если ВыводитьФото Тогда
		ОбластьШапка = МакетОбработки.ПолучитьОбласть("Шапка|Фото");	
		Табдок.Присоединить(ОбластьШапка); 	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =	
	"ВЫБРАТЬ
	|	ИС_Сбер_Отправлениеitems.Ссылка.Номер КАК Номер,
	|	ИС_Сбер_Отправлениеitems.Ссылка.Дата КАК Дата,
	|	ИС_Сбер_Отправлениеitems.НоменклатураМегаМаркета.Наименование КАК Наименование,
	|	ИС_Сбер_Товары.Характеристика КАК Характеристика,
	|	ЕСТЬNULL(ИС_Сбер_Товары.offerID,""Отсутствует сопоставление"") КАК offerID,
	|	ИС_Сбер_Отправлениеitems.НоменклатураМегаМаркета.Штрихкод КАК Штрихкод,
	|	ИС_Сбер_Товары.Номенклатура.ФайлКартинки КАК ФайлКартинки,
	|	ИС_Сбер_Товары.Номенклатура КАК Номенклатура
	|ИЗ
	|	Документ.ИС_Сбер_Отправление.items КАК ИС_Сбер_Отправлениеitems
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Сбер_Товары КАК ИС_Сбер_Товары
	|		ПО ИС_Сбер_Отправлениеitems.НоменклатураМегаМаркета.offer_id = ИС_Сбер_Товары.offerID
	|ГДЕ
	|	ИС_Сбер_Отправлениеitems.Ссылка В(&МассивСсылок)
	|	И ИС_Сбер_Отправлениеitems.status <> ЗНАЧЕНИЕ(Перечисление.ИС_Сбер_СтатусыОтправлений.MERCHANT_CANCELED)    
	|	И ИС_Сбер_Отправлениеitems.status <> ЗНАЧЕНИЕ(Перечисление.ИС_Сбер_СтатусыОтправлений.CUSTOMER_CANCELED)   
	|
	|УПОРЯДОЧИТЬ ПО
	|	%1";
	
    Запрос.Текст = СтрШаблон(Запрос.Текст, ?(СортировкаПечати = "Наименование", "Наименование, Характеристика", СортировкаПечати));

	Запрос.УстановитьПараметр("МассивСсылок", ВыделенныеСтроки);

	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("Не удалось сформировать лист подбора");
		Возврат Табдок;	
	КонецЕсли;
	
	Эталон = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ИС_МП_Эталон");

	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
					
	Выборка = РезультатЗапроса.Выбрать();
	
	ВысотаОбластей = Табдок.ВысотаТаблицы;
	
	Если ВыводитьКомплектующие Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =	
		"ВЫБРАТЬ
		|			ВТ.Номер КАК Номер,
		|			ВТ.Номенклатура КАК Номенклатура,
		|			ВТ.Характеристика КАК Характеристика,
		|			ВТ.Штрихкод КАК Штрихкод		
		|			ПОМЕСТИТЬ ВТ_Номенклатура
		|		ИЗ
		|			&ВТ КАК ВТ
		|		;
		|		
		|		////////////////////////////////////////////////////////////////////////////////
		|		ВЫБРАТЬ
		|			ВТ_Номенклатура.Номер КАК Номер,
		|			ВТ_Номенклатура.Номенклатура КАК Номенклатура,
		|			ВТ_Номенклатура.Характеристика КАК Характеристика,
		|			ВТ_Номенклатура.Штрихкод КАК Штрихкод,
		|			ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК НоменклатураНабора,
		|			ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК ХарактеристикаНабора,
		|			ВариантыКомплектацииНоменклатурыТовары.КоличествоУпаковок КАК КоличествоУпаковок
		|		ПОМЕСТИТЬ ВТ_СоставНаборов
		|		ИЗ
		|			ВТ_Номенклатура КАК ВТ_Номенклатура
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
		|				ПО ВТ_Номенклатура.Номенклатура = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец
		|					И ВТ_Номенклатура.Характеристика = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Характеристика
		|		ГДЕ
		|			ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|		;
		|		
		|		////////////////////////////////////////////////////////////////////////////////
		|		ВЫБРАТЬ
		|			ВТ_СоставНаборов.Номер КАК Номер,
		|			ВТ_СоставНаборов.Номенклатура КАК Номенклатура,
		|			ВТ_СоставНаборов.Характеристика КАК Характеристика,
		|			ВТ_СоставНаборов.Штрихкод КАК Штрихкод,
		|			ВТ_СоставНаборов.НоменклатураНабора КАК НоменклатураНабора,
		|			ВТ_СоставНаборов.ХарактеристикаНабора КАК ХарактеристикаНабора,
		|			ВТ_СоставНаборов.КоличествоУпаковок КАК КоличествоУпаковок,
		|			ВТ_СоставНаборов.НоменклатураНабора.ФайлКартинки КАК ФайлКартинки,
		|			ВТ_СоставНаборов.НоменклатураНабора.Марка КАК Бренд,
		|			ВТ_СоставНаборов.НоменклатураНабора.Артикул КАК Артикул
		|		ИЗ
		|			ВТ_СоставНаборов КАК ВТ_СоставНаборов
		|		
		|		УПОРЯДОЧИТЬ ПО
		|			ВТ_СоставНаборов.НоменклатураНабора.Наименование";     
		
		Запрос.УстановитьПараметр("ВТ", РезультатЗапроса.Выгрузить());
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыгрузкаНаборы = РезультатЗапроса.Выгрузить(); 
		
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл 
		
		ОбластьСтроки = МакетОбработки.ПолучитьОбласть("ДанныеСтроки|ОсновнойЛист");
		
		ОбластьСтроки.Параметры.НомерЗадания = Выборка.Номер;
		ОбластьСтроки.Параметры.Название     = СтрШаблон("%1 %2", Выборка.Наименование, Выборка.Характеристика);
		ОбластьСтроки.Параметры.Размер       = Выборка.Характеристика;
		ОбластьСтроки.Параметры.Артикул    = Выборка.offerID;
		
		ПараметрыШК = ИС_MP_ГенерацияШтрихкода.ПараметрыГенерацииШтрихкода();
		
		ПараметрыШК.Ширина = Окр(ОбластьСтроки.Рисунки.КартинкаШК.Ширина / КоличествоМиллиметровВПикселе);
		ПараметрыШК.Высота = Окр(ОбластьСтроки.Рисунки.КартинкаШК.Высота / КоличествоМиллиметровВПикселе);
		ПараметрыШК.РазмерШрифта = 10;
		ПараметрыШК.ТипКода = 4;
		ПараметрыШК.Штрихкод = Выборка.Штрихкод;
		ПараметрыШК.Масштабировать = Истина;
		ПараметрыШК.СохранятьПропорции = Истина;
		ПараметрыШК.ВертикальноеВыравнивание = 2; 
		
		СтруктураКартинки = ИС_MP_ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШК);
		
		Если СтруктураКартинки.Результат Тогда	
			ОбластьСтроки.Рисунки.КартинкаШК.Картинка = СтруктураКартинки.Картинка;
		КонецЕсли; 
		
		Если ВысотаОбластей + ОбластьСтроки.ВысотаТаблицы >= 71 Тогда 
			Табдок.ВывестиГоризонтальныйРазделительСтраниц();
			ВысотаОбластей = 0;
		КонецЕсли;
		
		
		Табдок.Вывести(ОбластьСтроки);
		
		Если ВыводитьФото Тогда
			
			ОбластьСтрокиФото = МакетОбработки.ПолучитьОбласть("ДанныеСтроки|Фото");
			Если ЗначениеЗаполнено(Выборка.ФайлКартинки) Тогда
				ОбластьСтрокиФото.Рисунки.КартинкаТовара.Картинка = Новый Картинка(РаботаСФайлами.ДвоичныеДанныеФайла(Выборка.ФайлКартинки));
			КонецЕсли;
			Табдок.Присоединить(ОбластьСтрокиФото);
			
		КонецЕсли;
		
		ВысотаОбластей = ВысотаОбластей + ОбластьСтроки.ВысотаТаблицы;
		
		Если ВыводитьКомплектующие Тогда                    
			
			Если ВыгрузкаНаборы.Количество() > 0 Тогда
				
				ОбластьСтроки = МакетОбработки.ПолучитьОбласть("ДанныеСтрокиНабора|ОсновнойЛист");
				
				НайденныеСтроки = ВыгрузкаНаборы.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", Выборка.Номенклатура, Выборка.Характеристика));
				
				Если НайденныеСтроки.Количество() > 0 Тогда
					
					Для Каждого Строка Из НайденныеСтроки Цикл
						
						ОбластьСтроки.Параметры.НомерЗадания = Строка.Номер;
						ОбластьСтроки.Параметры.Название     = СтрШаблон("Комплектующая набора: %1 %2 в количестве %3", Строка.НоменклатураНабора, Строка.ХарактеристикаНабора, Строка.КоличествоУпаковок);					
						ОбластьСтроки.Параметры.Артикул      = Строка.Артикул;																				
						
						Если ВысотаОбластей + ОбластьСтроки.ВысотаТаблицы >= 71 Тогда
							Табдок.ВывестиГоризонтальныйРазделительСтраниц();
							ВысотаОбластей = 0;
						КонецЕсли;
						
						Табдок.Вывести(ОбластьСтроки);  
						
						ВысотаОбластей = ВысотаОбластей + ОбластьСтроки.ВысотаТаблицы;
						
						Если ВыводитьФото Тогда
							
							ОбластьСтрокиФото = МакетОбработки.ПолучитьОбласть("ДанныеСтрокиНабора|Фото");
							Если ЗначениеЗаполнено(Строка.ФайлКартинки) Тогда
								ОбластьСтрокиФото.Рисунки.КартинкаТовараНабор.Картинка = Новый Картинка(РаботаСФайлами.ДвоичныеДанныеФайла(Строка.ФайлКартинки));
							КонецЕсли;
							Табдок.Присоединить(ОбластьСтрокиФото);
							
						КонецЕсли;
						
						ВыгрузкаНаборы.Удалить(Строка);
						
					КонецЦикла;
					
				КонецЕсли; 
				
			КонецЕсли;	    
			
		КонецЕсли;			
	КонецЦикла;
	
	Возврат Табдок;
	
КонецФункции //- ИнфоСофт Заварин К.В. 20.03.24 УА #66299

//+ ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
&НаКлиенте
Функция ПараметрыОжидания()

	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);	
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	Возврат ПараметрыОжидания;

КонецФункции //- ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207

//+ ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
&НаКлиенте
Процедура ПолучениеЗаказовЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Элементы["КартинкаОжидание"].Видимость = Ложь;
    
    Если Результат = Неопределено Тогда  // отменено пользователем
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);	
	КонецЕсли;
	
	Если Результат.Сообщения.Количество() > 0 Тогда
		
		Для Каждого Элемент Из Результат.Сообщения Цикл
			ОбщегоНазначенияКлиент.СообщитьПользователю(Элемент.Текст);
		КонецЦикла;
		
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207

//+ ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
&НаКлиенте
Процедура ОбновитьСтатусыЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Элементы["КартинкаОжиданиеСтатусы"].Видимость = Ложь;
    
    Если Результат = Неопределено Тогда  // отменено пользователем
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);	
	КонецЕсли;
	
	Если Результат.Сообщения.Количество() > 0 Тогда
		
		Для Каждого Элемент Из Результат.Сообщения Цикл
			ОбщегоНазначенияКлиент.СообщитьПользователю(Элемент.Текст);
		КонецЦикла;
		
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207

//+ ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207
&НаСервереБезКонтекста
Функция ПроверитьРегламетноеЗаданиеНаСервере(Профиль, ИмяКоманды)
	
	РеглАктивен = Ложь;
	
	Если Не РегламентныеЗаданияСервер.РаботаСВнешнимиРесурсамиЗаблокирована() Тогда
		
		УникальныйИдентификатор = ИС_MP_РаботаСРегламентнымиЗаданиями.ПолучитьУникальныйИдентификаторРегламентогоЗадания(Профиль, ИмяКоманды);
		
		Если ЗначениеЗаполнено(УникальныйИдентификатор) Тогда
			
			Попытка
				УстановитьПривилегированныйРежим(Истина);
				РегламентноеЗадание = РегламентныеЗаданияСервер.ПолучитьРегламентноеЗадание(УникальныйИдентификатор);
				
				РеглАктивен = ИС_MP_РаботаСРегламентнымиЗаданиями.ФоновоеЗаданиеАктивно(РегламентноеЗадание);
				УстановитьПривилегированныйРежим(Ложь);	 
			Исключение
				РеглАктивен = Ложь;
			КонецПопытки;	
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат РеглАктивен;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 04.04.2024 УА #67207

//+ ИнфоСофт Ивонин К.А. 04.04.24 УА #73304
&НаКлиенте
Процедура ПечатьЭтикеткиЗавершение(Результат, ДопПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЭтикетки = ДопПараметры;		
	ИмяВременногоФайла = Результат + "/" + Строка(Новый УникальныйИдентификатор) + "ММ.pdf";

	ДанныеЭтикетки.НачатьЗапись(Новый ОписаниеОповещения("ЗаписьЭтикеткиЗавершение", ЭтотОбъект, ИмяВременногоФайла), ИмяВременногоФайла);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 04.04.24 УА #73304

//+ ИнфоСофт Ивонин К.А. 04.04.24 УА #73304
&НаКлиенте
Процедура ЗаписьЭтикеткиЗавершение(Результат) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВременныеФайлы.Добавить(Результат);
	
	НачатьЗапускПриложения(Новый ОписаниеОповещения, Результат);

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 04.04.24 УА #73304

//+ ИнфоСофт Ивонин К.А. 31.03.24 УА #71892
&НаКлиенте 
Процедура ПодключитьРасширениеДляРаботыСФайлами(УстановитьЕслиНеПодключено) Экспорт  
	ОписаниеОповещения = Новый ОписаниеОповещения("ПодключитьРасширениеДляРаботыСФайламиЗавершение", ЭтотОбъект, УстановитьЕслиНеПодключено); 
	НачатьПодключениеРасширенияРаботыСФайлами(ОписаниеОповещения);
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 31.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 31.03.24 УА #71892
&НаКлиенте
Процедура ПодключитьРасширениеДляРаботыСФайламиЗавершение(Подключено, УстановитьЕслиНеПодключено) Экспорт
	
	Если Подключено Тогда
		Возврат;
	ИначеЕсли УстановитьЕслиНеПодключено Тогда  	
		ОписаниеОповещения = Новый ОписаниеОповещения("ПодключитьРасширениеДляРаботыСФайлами", ЭтотОбъект, Ложь);     
		НачатьУстановкуРасширенияРаботыСФайлами(ОписаниеОповещения);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось подключить расширение для работы с файлами...");
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 31.03.24 УА #71892

//+ ИнфоСофт Стояк Ю.К. 03.06.2024 УА #76167
&НаСервере
Функция ПолучитьРеестрПриемаПередачи(ВыделенныеСтроки)
	
	ДанныеТабЧасти = Новый Массив;
	
	ТабДок = Новый ТабличныйДокумент;
	
	ТабДок.ИмяПараметровПечати = "ИС_Сбер_ПечатьРеестраПриемаПередачи";
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;  
	ТабДок.АвтоМасштаб = Истина;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИС_Сбер_Отправление.ПФ_MXL_РеестрПриемаПередачи");
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить("СберИдКабинета");
	МассивПараметров.Добавить("СберКонтрагент");
	МассивПараметров.Добавить("СберДоговор");
	
	ДанныеПрофиля = ИС_MP_Сервер.ПолучитьНастройки(Профиль, МассивПараметров);  
	
	ДанныеШапки = Новый Структура("НомерДокумента, ДатаДокумента, Исполнитель, Заказчик, Договор");
	
	ДанныеШапки.ДатаДокумента  = Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy") + ".г";
	ДанныеШапки.НомерДокумента = Формат(ДанныеПрофиля["СберИдКабинета"], "ЧГ=0") + Формат(ТекущаяДата(),"ДФ=ддММгггг"); 
	ДанныеШапки.Исполнитель    = ДанныеПрофиля["СберКонтрагент"].Наименование;
	ДанныеШапки.Заказчик       = Профиль.Организация.Наименование;
	ДанныеШапки.Договор        = ДанныеПрофиля["СберДоговор"].Наименование;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заполнить(ДанныеШапки);
	
	ТабДок.Вывести(ОбластьМакета); 
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДок.Вывести(ОбластьМакета);
	
	ОбластьМакетаОтправление   = Макет.ПолучитьОбласть("Строка|ОбластьОтправление");
	ОбластьМакетаГрузовоеМесто = Макет.ПолучитьОбласть("Строка|ОбластьГрузовоеМесто");
	ОбластьМакетаЕдиница       = Макет.ПолучитьОбласть("Строка|ОбластьЕдиницаОтправления");
	ОбластьМакетаСтоимость     = Макет.ПолучитьОбласть("Строка|ОбластьСтоимостьОтправления");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_Сбер_Отправление.Ссылка.Номер КАК НомерОтправления
		|ИЗ
		|	Документ.ИС_Сбер_Отправление КАК ИС_Сбер_Отправление
		|ГДЕ
		|	ИС_Сбер_Отправление.Ссылка В(&МассивОтправлений)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерОтправления";
	
	Запрос.УстановитьПараметр("МассивОтправлений", ВыделенныеСтроки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(); 
	
	МассивОтправлений = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		МассивОтправлений.Добавить(Выборка.НомерОтправления);
	КонецЦикла;

	ДанныеОтправлений = ИС_Сбер_Сервер.ПолучитьДанныеОтправлений(Профиль, МассивОтправлений); 

	Если ДанныеОтправлений = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить данные отправлений с сервера!");
		Возврат Неопределено;
	КонецЕсли;	
	
	ДанныеПодвалаТаблицы = Новый Структура("ИтогоСтрок, ИтогоКоличество, ИтогоСтоимость, ИтогоСтоимостьСоСкидкой", 0, 0, 0, 0);
	
	НомерПП = 0;
	
	Для Каждого Отправление Из ДанныеОтправлений Цикл     
		
		НомерПП = НомерПП + 1;
		
		СтоимостьОтправленияСоСкидкой = 0;
		
		ОбластьМакетаОтправление   = Макет.ПолучитьОбласть("Строка|ОбластьОтправление");
		ОбластьМакетаГрузовоеМесто = Макет.ПолучитьОбласть("Строка|ОбластьГрузовоеМесто");
		ОбластьМакетаЕдиница       = Макет.ПолучитьОбласть("Строка|ОбластьЕдиницаОтправления");
		ОбластьМакетаСтоимость     = Макет.ПолучитьОбласть("Строка|ОбластьСтоимостьОтправления");
		
		ОбластьМакетаОтправление.Параметры.НомерПП             = НомерПП;
		ОбластьМакетаОтправление.Параметры.НомерДоставки       = Отправление.deliveryId;
		ОбластьМакетаОтправление.Параметры.НомерОтправления    = Отправление.shipmentId;
		ОбластьМакетаОтправление.Параметры.НомерЗаказаПродавца = Отправление.orderCode;
		
		НаборЛотов = Отправление.items;
		
		ТаблицаГрузовыхМест = ПолучитьКоличествоГрузовыхМест(НаборЛотов);
		
		СписокГрузовыхМест = ТаблицаГрузовыхМест.Скопировать(,"ИдентификаторГрузовогоМеста");
		СписокГрузовыхМест.Свернуть("ИдентификаторГрузовогоМеста");
		
		ТабДокОтправление = Новый ТабличныйДокумент;
		ТабДокОтправление.Вывести(ОбластьМакетаОтправление);
		
		КоличествоСтрок = 0;
		
		ТабДокГрузовыеМеста = Новый ТабличныйДокумент;
		
		Для Каждого ГрузовоеМесто Из СписокГрузовыхМест Цикл
			
			ИдентификаторГрузовогоМеста = Формат(ДанныеПрофиля["СберИдКабинета"], "ЧГ=0") + "*" + Отправление.orderCode 
				+ "*" + ГрузовоеМесто.ИдентификаторГрузовогоМеста;
			
			ОбластьМакетаГрузовоеМесто.Параметры.ИдентификаторГрузовогоМеста = ИдентификаторГрузовогоМеста;
			
			ЕдиницыГрузовогоМеста = ТаблицаГрузовыхМест.НайтиСтроки(Новый Структура("ИдентификаторГрузовогоМеста", ГрузовоеМесто.ИдентификаторГрузовогоМеста));
			
			КоличествоЕдиниц = 0;
			
			ТабДокЕдиницы = Новый ТабличныйДокумент;
			
			Для Каждого Единица Из ЕдиницыГрузовогоМеста Цикл 
				
				КоличествоЕдиниц = КоличествоЕдиниц + 1;
				
				ОбластьМакетаЕдиница.Параметры.Количество = Единица.Количество;
				ОбластьМакетаЕдиница.Параметры.Стоимость  = Единица.Стоимость;
				
				ДанныеПодвалаТаблицы.ИтогоКоличество = ДанныеПодвалаТаблицы.ИтогоКоличество + Единица.Количество;
				ДанныеПодвалаТаблицы.ИтогоСтоимость  = ДанныеПодвалаТаблицы.ИтогоСтоимость + Единица.Стоимость;
				
				СтоимостьОтправленияСоСкидкой = СтоимостьОтправленияСоСкидкой + Единица.СтоимостьСоСкидкой;
				
				ТабДокЕдиницы.Вывести(ОбластьМакетаЕдиница); 
				
			КонецЦикла;
			
			КоличествоСтрок = КоличествоСтрок + КоличествоЕдиниц;
			
			ОбластьМакетаГрузовоеМесто.Область("R1C1:R" + КоличествоЕдиниц + "C1").Объединить();
			
			ТабДокГрузовыеМеста.Вывести(ОбластьМакетаГрузовоеМесто);
			ТабДокГрузовыеМеста.Присоединить(ТабДокЕдиницы);
			
		КонецЦикла;
		
		ДанныеПодвалаТаблицы.ИтогоСтоимостьСоСкидкой = ДанныеПодвалаТаблицы.ИтогоСтоимостьСоСкидкой + СтоимостьОтправленияСоСкидкой;
		
		ТабДокОтправление.Присоединить(ТабДокГрузовыеМеста);
		
		ОбластьМакетаСтоимость.Параметры.СтоимостьСоСкидкой = СтоимостьОтправленияСоСкидкой;
		ТабДокОтправление.Присоединить(ОбластьМакетаСтоимость);
		
		ТабДокОтправление.Область("R1C1:R" + КоличествоСтрок + "C1").Объединить();
		ТабДокОтправление.Область("R1C2:R" + КоличествоСтрок + "C2").Объединить();
		ТабДокОтправление.Область("R1C3:R" + КоличествоСтрок + "C3").Объединить();
		ТабДокОтправление.Область("R1C4:R" + КоличествоСтрок + "C4").Объединить();
		ТабДокОтправление.Область("R1C5:R" + КоличествоСтрок + "C5").Объединить();
		ТабДокОтправление.Область("R1C9:R" + КоличествоСтрок + "C9").Объединить();
		
		ТабДокОтправление.Область("R1C9:R1C9").ГраницаСправа = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
		
		ТабДок.Вывести(ТабДокОтправление);
		
	КонецЦикла;
	
	ДанныеПодвалаТаблицы.ИтогоСтрок = НомерПП;
	
	ОбластьМакета = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьМакета.Параметры.Заполнить(ДанныеПодвалаТаблицы); 
	ТабДок.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакета.Параметры.Заполнить(ДанныеШапки); 
	ТабДок.Вывести(ОбластьМакета);
	
	Возврат ТабДок;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 03.06.2024 УА #76167

//+ ИнфоСофт Стояк Ю.К. 03.06.2024 УА #76167
&НаСервере
Функция ПолучитьКоличествоГрузовыхМест(НаборЛотов);
	
	ТаблицаГрузовыхМест = Новый ТаблицаЗначений;
	ТаблицаГрузовыхМест.Колонки.Добавить("ИдентификаторГрузовогоМеста");
	ТаблицаГрузовыхМест.Колонки.Добавить("Количество");
	ТаблицаГрузовыхМест.Колонки.Добавить("Стоимость");
	ТаблицаГрузовыхМест.Колонки.Добавить("СтоимостьСоСкидкой");
	
	Для Каждого Лот Из НаборЛотов Цикл
		
		НоваяСтрока = ТаблицаГрузовыхМест.Добавить();
		НоваяСтрока.ИдентификаторГрузовогоМеста = ?(Лот.boxIndex = "", "1", Лот.boxIndex);
		НоваяСтрока.Количество                  = Лот.quantity;
		НоваяСтрока.Стоимость                   = Лот.price;
		НоваяСтрока.СтоимостьСоСкидкой          = Лот.finalPrice;
		
	КонецЦикла;
	
	ТаблицаГрузовыхМест.Сортировать("ИдентификаторГрузовогоМеста Возр");
	
	Возврат ТаблицаГрузовыхМест;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 03.06.2024 УА #76167

//+ ИнфоСофт Стояк Ю.К. 05.11.2024 УА #70035
&НаСервере
Функция ПолучитьТоварныйЧек(ВыделенныеСтроки)
	
	ТабДок = Новый ТабличныйДокумент;
	
	ТабДок.ИмяПараметровПечати = "ИС_Сбер_ПечатьТоварногоЧека";
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;  
	ТабДок.АвтоМасштаб = Истина;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИС_Сбер_Отправление.ПФ_MXL_ТоварныйЧек"); 
	
	ОбластьМакетаШапка			= Макет.ПолучитьОбласть("Шапка");
	ОбластьМакетаЗаголовок		= Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакетаШапкаТаблицы   = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьМакетаСтрокаТаблицы  = Макет.ПолучитьОбласть("СтрокаТаблицы");
	ОбластьМакетаИтого	        = Макет.ПолучитьОбласть("Итого");
	ОбластьМакетаИнформация     = Макет.ПолучитьОбласть("ИнформацияОВозврате");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_Сбер_Отправлениеitems.НоменклатураМегаМаркета КАК Товар,
		|	ИС_Сбер_Отправлениеitems.quantity КАК Количество,
		|	ИС_Сбер_Отправлениеitems.finalPrice КАК Цена,
		|	ИС_Сбер_Отправлениеitems.quantity * ИС_Сбер_Отправлениеitems.finalPrice КАК Сумма,
		|	ИС_Сбер_Отправлениеitems.offerId КАК Артикул,
		|	ИС_Сбер_Отправлениеitems.Ссылка.customerAddress КАК АдресПокупателя,
		|	ИС_Сбер_Отправлениеitems.Ссылка.customerFullName КАК ФИОПокупателя,
		|	ИС_Сбер_Отправлениеitems.Ссылка.Профиль.Организация КАК Организация,
		|	ИС_Сбер_Отправлениеitems.Ссылка.orderCode КАК НомерЧека
		|ИЗ
		|	Документ.ИС_Сбер_Отправление.items КАК ИС_Сбер_Отправлениеitems
		|ГДЕ
		|	ИС_Сбер_Отправлениеitems.Ссылка В(&МассивОтправлений)
		|ИТОГИ ПО
		|	НомерЧека";
	
	Запрос.УстановитьПараметр("МассивОтправлений", ВыделенныеСтроки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНомерОтправления = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "НомерЧека");
	
	МассивОтправлений = Новый Массив;
	
	Пока ВыборкаНомерОтправления.Следующий() Цикл 
		
		ВыборкаСтрок = ВыборкаНомерОтправления.Выбрать();
		ДанныеПодвалаТаблицы = Новый Структура("КоличествоСтрок, СуммаИтого", 0, 0);
		НомерСтроки = 1;
		
		ЗаполнениеОсновныхПараметров = Истина;
		
		Пока ВыборкаСтрок.Следующий() Цикл   
			
			Если ЗаполнениеОсновныхПараметров Тогда
				
				ЗаполнитьЗначенияСвойств(ОбластьМакетаЗаголовок.Параметры, ВыборкаСтрок); 
				ОбластьМакетаЗаголовок.Параметры.Дата = ТекущаяДатаСеанса();	
				ТабДок.Вывести(ОбластьМакетаЗаголовок);			
				
				ЗаполнитьЗначенияСвойств(ОбластьМакетаШапка.Параметры, ВыборкаСтрок); 				
				ТабДок.Вывести(ОбластьМакетаШапкаТаблицы);  
				
				ЗаполнитьЗначенияСвойств(ОбластьМакетаИтого.Параметры, ВыборкаСтрок); 												
				ЗаполнениеОсновныхПараметров = Ложь;
				
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(ОбластьМакетаСтрокаТаблицы.Параметры, ВыборкаСтрок); 
			ОбластьМакетаСтрокаТаблицы.Параметры.НомерСтроки = НомерСтроки;
			НомерСтроки = НомерСтроки + 1;
			ТабДок.Вывести(ОбластьМакетаСтрокаТаблицы);
			
			ДанныеПодвалаТаблицы.КоличествоСтрок = ДанныеПодвалаТаблицы.КоличествоСтрок + 1;
			ДанныеПодвалаТаблицы.СуммаИтого  = ДанныеПодвалаТаблицы.СуммаИтого + ВыборкаСтрок.Сумма;						
						
		КонецЦикла;                                                                                 
		
		ЗаполнитьЗначенияСвойств(ОбластьМакетаИтого.Параметры, ДанныеПодвалаТаблицы); 
		ФормСтрока = "Л = ru_RU; ДП = Истина";
		ПарПредмета="рубль, рубля, рублей, м, копейка, копейки, копеек, ж";
		
		ОбластьМакетаИтого.Параметры.ТекстовоеПредставлениеСуммы = ЧислоПрописью(ДанныеПодвалаТаблицы.СуммаИтого, ФормСтрока, ПарПредмета);
		
		ТабДок.Вывести(ОбластьМакетаИтого);
		
		ТабДок.Вывести(ОбластьМакетаИнформация);
		
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			
	КонецЦикла;

		
	Возврат ТабДок; 
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 05.11.2024 УА #70035

//+ ИнфоСофт Заварин К.В. 13.11.24 УА #85881
&НаСервере
Процедура ПометитьНаУдалениеПривязанныеДокументыНаСервере()
	
	Событие = "ИС_Сбер_Отправление.ПометитьНаУдалениеПривязанныеДокументыНаСервере";
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	Для Каждого Строка Из ВыделенныеСтроки Цикл
		
		ИС_MP_РаботаСЗаказами.ПометитьНаУдалениеПривязанныеДокументы(Строка.Заказ);
		
		СтрокаСборочноеЗадание = Строка.ПолучитьОбъект();
		
		СтрокаСборочноеЗадание.ПометкаУдаления = Истина; 			
		
		Попытка	
			СтрокаСборочноеЗадание.Записать();
		Исключение 
			
			Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИС_MP_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст);
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 13.11.24 УА #85881

#КонецОбласти
